app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(school_class_params)
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Worst Class"], ["room_number", 5], ["created_at", "2020-04-28 15:55:32.308283"], ["updated_at", "2020-04-28 15:55:32.308283"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 10], ["updated_at", "2020-04-28 15:57:55.574493"], ["id", 3]]