app/controllers/students_controller.rb

    def create
        @student = Student.create (student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Mike"], ["last_name", "Jiang"], ["created_at", "2020-04-28 15:36:16.568916"], ["updated_at", "2020-04-28 15:36:16.568916"]]

    def update
        @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Michaela"], ["updated_at", "2020-04-28 15:41:26.405909"], ["id", 5]]

    def find_student
        @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]